/*
0666 ~ 5666     (1~6)
//6660 ~ 6669   (7~16)

7666 ~ 15666    (17~25)
//16660 ~ 16669 (26~35)

17666 ~ 25666   (36~44)
//26660 ~ 26669 (45~54)

27666 ~ 35666   (55~64)
//36660 ~ 36669 (65~74)

37666 ~ 45666
//46660 ~ 46669     (75~94)

47666 ~ 56669       (95~114)
57666 ~ 65666       (115~123)

////66600 ~ 66699   (124 ~ 223)

*/
//i++을 하면서 모든 수에 666이 포함되어 있는지를 확인 -> 666이 포함되어 있으면 cnt++ -> cnt==input이면 해당 i를 출력
#include <iostream>
using std::cin;
using std::cout;

int main(){
    int i=665;
    int target, cnt = 0;
    cin >> target;

    while(cnt!=target){
        i++;
        int tmp1 = i;
        int tmp2 = i;

        while(tmp1>=666){
            if(tmp1%1000==666){
                cnt++;
                break;
            }
            tmp2/=10;
            tmp1=tmp2;
        }
    }
    cout << i;
}